# ApplicationEntryPoint Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationEntryPoint Properties
ApplicationEntryPoint Class See Also
---
The ApplicationEntryPoint type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ActiveAddInId | Get current active external application or external command id.  (Inherited from UIApplication.) |
| ActiveUIDocument | Provides access to an object that represents the currently active project. (Inherited from UIApplication.) |
| AddinFolder | The full path to the Revit Macros module. |
| Application | Returns the database level Application represented by this UI level Application.  (Inherited from UIApplication.) |
| DrawingAreaExtents | Get the rectangle that represents the screen pixel coordinates of drawing area.  (Inherited from UIApplication.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from UIApplication.) |
| IsViewerModeActive | Determines if Revit session is in Viewer mode.  (Inherited from UIApplication.) |
| LoadedApplications | Returns an array of successfully loaded external applications.  (Inherited from UIApplication.) |
| MainWindowExtents | Get the rectangle that represents the screen pixel coordinates of the Revit main window.  (Inherited from UIApplication.) |
| MainWindowHandle | Get the handle of the Revit main window. (Inherited from UIApplication.) |
| ProductIsRS | Identifies if the current Revit product has an RS designation. Most add-ins will not need to use this information.  (Inherited from UIApplication.) |

# See Also
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace